**Контрольная работа**

Задание к итоговой контрольной работе :

1. Создать репозиторий на GitHub

2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)

3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)

4. Написать программу, решающую поставленную задачу

5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)

6. Задача :Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

**Решение задачи**

Этот код выполняет фильтрацию строк из исходного массива (initialArray), оставляя только те строки, длина которых меньше или равна 3 символам. 

**МЕТОД FilterStrings**

Этот метод принимает исходный массив строк и возвращает массив строк, содержащий только строки, длина которых меньше или равна 3 символам.

1. int count = 0; - Создается переменная count для подсчета количества строк, которые удовлетворяют условию (длина <= 3).

2. Первый цикл for проходит по исходному массиву arr и увеличивает count каждый раз, когда находит строку, длина которой меньше или равна 3 символам.

3. Создается новый массив result размера count, который будет содержать отфильтрованные строки.

4. int index = 0; - Инициализируется индекс для добавления строк в новый массив result.

5. Второй цикл for снова проходит по исходному массиву arr, и если строка удовлетворяет условию (длина <= 3), она добавляется в result, используя переменную index для правильного размещения в массиве.

6. Возвращается отфильтрованный массив строк result.

**Цикл ввода отфильтрованных строк**

После получения отфильтрованного массива в переменной filteredArray, код использует цикл for, чтобы вывести отфильтрованные строки через запятую.

•	Console.Write(filteredArray[i]); - Выводит текущий элемент отфильтрованного массива.

•	if (i < filteredArray.Length - 1) - Проверяет, не является ли текущий элемент последним в массиве, чтобы определить, нужно ли добавлять запятую после вывода элемента.

•	Console.WriteLine(); - Добавляет перевод строки после вывода всех отфильтрованных строк.

